malpern/KeyPath/Scripts/lab/pico-hid-fixture/targets/waveshare-esp32-s3-touch-lcd-1.69/main/fixture_display.c
    set_hidden(ui.brand_keycap, true);
    set_hidden(ui.brand_light, true);
    set_hidden(ui.brand_lid, true);
    set_hidden(ui.brand_glint_horizontal, true);
    set_hidden(ui.brand_glint_vertical, true);

    for (size_t index = 0; index < PARTICLE_COUNT; ++index) {
        ui.particles[index] = make_circle(ui.screen, index % 3u == 0u ? 6 : 4,
                                          lv_color_hex(0x56ddb3), LV_OPA_50);
    }

    ui.state = lv_label_create(ui.screen);
    lv_label_set_text_static(ui.state, "WAKING UP");
    lv_obj_set_style_text_font(ui.state, &lv_font_montserrat_24, 0);
    lv_obj_set_style_text_color(ui.state, lv_color_hex(0xe9f7f4), 0);
    lv_obj_set_width(ui.state, 220);
    lv_label_set_long_mode(ui.state, LV_LABEL_LONG_DOT);
    lv_obj_set_style_text_align(ui.state, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_align(ui.state, LV_ALIGN_BOTTOM_MID, 0, -40);

    ui.detail = lv_label_create(ui.screen);
    lv_label_set_text_static(ui.detail, "USB + Wi-Fi control");
    lv_obj_set_style_text_font(ui.detail, &lv_font_montserrat_14, 0);
    lv_obj_set_style_text_color(ui.detail, lv_color_hex(0x78909a), 0);
    lv_obj_set_width(ui.detail, 220);
    lv_label_set_long_mode(ui.detail, LV_LABEL_LONG_DOT);
    lv_obj_set_style_text_align(ui.detail, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_align(ui.detail, LV_ALIGN_BOTTOM_MID, 0, -20);

    ui.quality = lv_label_create(ui.screen);
    lv_label_set_text_static(ui.quality, "CINEMATIC");
    lv_obj_set_style_text_font(ui.quality, &lv_font_montserrat_12, 0);
    lv_obj_set_style_text_color(ui.quality, lv_color_hex(0x52727e), 0);
    lv_obj_set_style_text_letter_space(ui.quality, 1, 0);
    lv_obj_align(ui.quality, LV_ALIGN_TOP_RIGHT, -10, 38);
    ui.previous_scene = FIXTURE_UI_BOOT;
    ui.visual_stage = -1;
}

static void build_splash(void) {
    lv_color_t dojo_red = lv_color_hex(0xe13838);
    lv_color_t white = lv_color_hex(0xffffff);

    splash.root = lv_obj_create(ui.screen);
    lv_obj_remove_style_all(splash.root);
    lv_obj_set_size(splash.root, LV_PCT(100), LV_PCT(100));
    lv_obj_align(splash.root, LV_ALIGN_CENTER, 0, 0);
    lv_obj_set_style_bg_color(splash.root, lv_color_hex(0x080c10), 0);
    lv_obj_set_style_bg_opa(splash.root, LV_OPA_COVER, 0);
    lv_obj_clear_flag(splash.root, LV_OBJ_FLAG_SCROLLABLE | LV_OBJ_FLAG_CLICKABLE);

    /*
     * Keep the glow inside a bounded redraw region. Transforming the previous
     * 154 px object at 60 FPS invalidated most of the 240 x 280 display and
     * could starve the LVGL flush task on the physical SPI panel.
     */
    splash.glow = make_circle(splash.root, 132, dojo_red, LV_OPA_TRANSP);
    lv_obj_align(splash.glow, LV_ALIGN_CENTER, 0, -27);

    splash.ring = make_circle(splash.root, 118, dojo_red, LV_OPA_TRANSP);
    lv_obj_set_style_border_width(splash.ring, 2, 0);
    lv_obj_set_style_border_color(splash.ring, dojo_red, 0);
    lv_obj_set_style_border_opa(splash.ring, LV_OPA_TRANSP, 0);
    lv_obj_align(splash.ring, LV_ALIGN_CENTER, 0, -27);

    splash.logo = lv_obj_create(splash.root);
    lv_obj_remove_style_all(splash.logo);
    lv_obj_set_size(splash.logo, 92, 92);
    lv_obj_set_style_radius(splash.logo, 24, 0);
    lv_obj_set_style_bg_color(splash.logo, dojo_red, 0);
    lv_obj_set_style_bg_opa(splash.logo, LV_OPA_TRANSP, 0);
    lv_obj_align(splash.logo, LV_ALIGN_CENTER, 0, -27);

    /* Faithful, display-native reconstruction of hackerdojo.org/static/images/logo.png. */
    splash.bars[0] = make_rect(splash.logo, 20, 29, 52, 5, white);
    splash.bars[1] = make_rect(splash.logo, 16, 40, 60, 5, white);
    splash.bars[2] = make_rect(splash.logo, 31, 26, 5, 41, white);
    splash.bars[3] = make_rect(splash.logo, 56, 26, 5, 41, white);

    splash.wordmark = lv_label_create(splash.root);
    lv_label_set_text_static(splash.wordmark, "HACKER DOJO");
    lv_obj_set_style_text_font(splash.wordmark, &lv_font_montserrat_24, 0);
    lv_obj_set_style_text_color(splash.wordmark, white, 0);
    lv_obj_set_style_text_letter_space(splash.wordmark, 3, 0);
    lv_obj_set_style_text_opa(splash.wordmark, LV_OPA_TRANSP, 0);
    lv_obj_align(splash.wordmark, LV_ALIGN_CENTER, 0, 48);

    splash.location = lv_label_create(splash.root);
    lv_label_set_text_static(splash.location, "MOUNTAIN VIEW  /  SINCE 2009");
    lv_obj_set_style_text_font(splash.location, &lv_font_montserrat_12, 0);
    lv_obj_set_style_text_color(splash.location, lv_color_hex(0x9aa7ad), 0);
    lv_obj_set_style_text_letter_space(splash.location, 1, 0);
    lv_obj_set_style_text_opa(splash.location, LV_OPA_TRANSP, 0);
    lv_obj_align(splash.location, LV_ALIGN_CENTER, 0, 74);
}

static void render_splash(const fixture_splash_output_t *output, uint64_t elapsed_ms) {
    lv_opa_t foreground = (lv_opa_t)output->foreground_opacity;
    /*
     * Do not animate opacity on the full-screen root. The logo and wordmark
     * still fade out before the root is deleted, but every frame now redraws
     * only the splash artwork rather than the entire panel.
     */
    lv_obj_set_style_bg_opa(splash.root, LV_OPA_COVER, 0);
    lv_obj_set_style_bg_opa(splash.logo, foreground, 0);
    for (size_t index = 0; index < DOJO_BAR_COUNT; ++index) {
        lv_obj_set_style_bg_opa(splash.bars[index], foreground, 0);
    }

    lv_obj_set_style_text_opa(splash.wordmark, (lv_opa_t)output->wordmark_opacity, 0);
    lv_obj_set_style_text_opa(splash.location,
                              (lv_opa_t)(output->wordmark_opacity * 3u / 4u), 0);
    int wordmark_offset = 5 - (int)(output->wordmark_opacity * 5u / 255u);
    lv_obj_set_style_translate_y(splash.wordmark, wordmark_offset, 0);
    lv_obj_set_style_translate_y(splash.location, wordmark_offset, 0);

    uint16_t ring_phase = (uint16_t)(elapsed_ms % 800u);
    uint16_t ring_fade = (uint16_t)(255u - ring_phase * 255u / 800u);
    lv_obj_set_style_border_opa(
        splash.ring,
        (lv_opa_t)(output->foreground_opacity * ring_fade * 44u / (255u * 255u)), 0);

    int glow_pulse = (int)(sinf((float)elapsed_ms / 230.0f) * 4.0f);
    lv_obj_set_style_bg_opa(splash.glow,
                            (lv_opa_t)(output->foreground_opacity *
                                       (uint32_t)(22 + glow_pulse) / 255u), 0);
}

static void play_splash(void) {
    uint64_t started_ms = (uint64_t)(esp_timer_get_time() / 1000);
    while (true) {
        uint64_t now_ms = (uint64_t)(esp_timer_get_time() / 1000);
        uint64_t elapsed_ms = now_ms >= started_ms ? now_ms - started_ms : 0u;
        fixture_splash_output_t output = fixture_splash_step(elapsed_ms);
        bool finished = false;
        if (bsp_display_lock(20u)) {
            render_splash(&output, elapsed_ms);
            note_display_frame(now_ms);
            if (output.complete) {
                lv_obj_delete(splash.root);
                splash.root = NULL;
                note_splash_complete();
                finished = true;
            }
            bsp_display_unlock();
        }
        if (finished) return;
        vTaskDelay(pdMS_TO_TICKS(SPLASH_FRAME_INTERVAL_MS));
    }
}

