malpern/KeyPath/Scripts/lab/pico-hid-fixture/targets/waveshare-esp32-s3-touch-lcd-1.69/main/fixture_display.c
static void announce_transition(const fixture_ui_output_t *output) {
    if (output->scene == ui.previous_scene) return;
    switch (output->scene) {
        case FIXTURE_UI_LOADED: fixture_board_tone(660u, 45u); break;
        case FIXTURE_UI_ARMED: fixture_board_tone(880u, 70u); break;
        case FIXTURE_UI_RUNNING: fixture_board_tone(1100u, 50u); break;
        case FIXTURE_UI_COMPLETE:
            fixture_board_tone(880u, 55u);
            fixture_board_tone(1320u, 90u);
            break;
        case FIXTURE_UI_ERROR: fixture_board_tone(180u, 180u); break;
        default: break;
    }
    ui.previous_scene = output->scene;
}

static void announce_result(fixture_result_t result) {
    if (result == ui.previous_result) return;
    if (result == FIXTURE_RESULT_PASS) {
        fixture_board_tone(880u, 55u);
        fixture_board_tone(1320u, 95u);
    } else if (result == FIXTURE_RESULT_FAIL) {
        fixture_board_tone(180u, 190u);
    } else if (result == FIXTURE_RESULT_INCONCLUSIVE) {
        fixture_board_tone(540u, 80u);
    }
    ui.previous_result = result;
}

static void render_button_feedback(uint64_t now_ms) {
    fixture_board_feedback_t feedback;
    fixture_board_feedback_snapshot(&feedback);
    if (feedback.sequence != ui.button_feedback_sequence) {
        ui.button_feedback_sequence = feedback.sequence;
        ui.button_feedback_event = feedback.event;
        ui.button_feedback_started_ms = now_ms;
    }

    uint64_t elapsed_ms = now_ms >= ui.button_feedback_started_ms
                              ? now_ms - ui.button_feedback_started_ms : 0u;
    fixture_button_feedback_output_t output =
        fixture_button_feedback_resolve(ui.button_feedback_event, feedback.boot_held,
                                        feedback.download_hint, elapsed_ms);
    if (!output.active) return;

    lv_color_t accent = lv_color_hex(output.accent_rgb);
    lv_label_set_text(ui.state, output.title);
    lv_label_set_text(ui.detail, output.detail);
    lv_label_set_text_static(ui.quality, "BUTTON INPUT");
    lv_obj_set_style_text_color(ui.state, accent, 0);
    lv_obj_set_style_text_color(ui.quality, accent, 0);
    lv_obj_set_style_arc_color(ui.orbit, accent, LV_PART_INDICATOR);
    lv_obj_set_style_arc_color(ui.progress, accent, LV_PART_INDICATOR);
    lv_obj_set_style_border_color(ui.core, accent, 0);
    lv_obj_set_style_bg_color(ui.halo_inner, accent, 0);
    lv_obj_set_style_bg_color(ui.halo_outer, accent, 0);
    lv_obj_set_style_bg_opa(ui.halo_inner,
                            (lv_opa_t)(24u + output.pulse_per_mille * 40u / 1000u), 0);
    lv_obj_set_style_bg_opa(ui.halo_outer,
                            (lv_opa_t)(12u + output.pulse_per_mille * 24u / 1000u), 0);
    lv_obj_set_style_transform_scale(ui.state,
                                     256 + (int)(output.pulse_per_mille * 10u / 1000u), 0);
}

static void render(const fixture_ui_output_t *output,
                   const fixture_presentation_t *presentation,
                   const char *automatic_detail, uint64_t now_ms) {
    fixture_visual_output_t visual;
    fixture_visual_resolve(output, presentation, &visual);
    lv_color_t accent = lv_color_hex(visual.accent_rgb);
    int energy = output->energy_per_mille;
    uint64_t elapsed_ms = ui.previous_render_ms && now_ms > ui.previous_render_ms
                              ? now_ms - ui.previous_render_ms : output->frame_interval_ms;
    if (elapsed_ms > 250u) elapsed_ms = 250u;
    float speed = (float)visual.angular_speed_milliradians / 1000.0f;
#if CONFIG_KEYPATH_FIXTURE_REDUCED_MOTION
    speed = 0.0f;
#endif
    ui.phase += speed * (float)elapsed_ms / 1000.0f;
    if (ui.phase > 6.2831853f) ui.phase -= 6.2831853f;
    ui.previous_render_ms = now_ms;

    float completion_wave = 0.0f;
#if !CONFIG_KEYPATH_FIXTURE_REDUCED_MOTION
    if (ui.completion_started_ms > 0u && now_ms >= ui.completion_started_ms) {
        uint64_t elapsed_ms = now_ms - ui.completion_started_ms;
        if (elapsed_ms < 700u) completion_wave = sinf((float)elapsed_ms / 700.0f * 3.1415927f);
    }
#endif

    lv_obj_set_style_bg_color(ui.screen, output->scene == FIXTURE_UI_ERROR
                                             ? lv_color_hex(0x190b13)
                                             : lv_color_hex(0x071117), 0);
    lv_obj_set_style_transform_scale(ui.state, 256, 0);
    lv_label_set_text(ui.state, visual.title);
    lv_obj_set_style_text_color(ui.state, accent, 0);
    lv_obj_set_style_arc_color(ui.orbit, accent, LV_PART_INDICATOR);
    lv_obj_set_style_arc_color(ui.progress, accent, LV_PART_INDICATOR);
    lv_obj_set_style_border_color(ui.core, accent, 0);
    lv_arc_set_value(ui.progress, visual.progress_per_mille);

    bool branded_update = visual.variant == FIXTURE_VISUAL_KEYPATH_UPDATE;
    bool bear_test = visual.variant == FIXTURE_VISUAL_BEAR_TEST;
    lv_label_set_text_static(
        ui.eyebrow, branded_update ? "KEYPATH  /  SECURE UPDATE" :
                    bear_test ? "BEAR  /  TYPOVER TEST" : "KEYPATH  /  HID ORACLE");
    lv_obj_set_style_text_color(ui.eyebrow,
                                bear_test ? lv_color_hex(0xe34c42) : lv_color_hex(0x71909d), 0);
    set_hidden(ui.core, branded_update || bear_test);
    set_hidden(ui.icon_front, branded_update || bear_test);
    set_hidden(ui.icon_back, branded_update || bear_test);
    set_hidden(ui.brand_keycap, !branded_update);
    set_hidden(ui.brand_light, !branded_update);
    set_hidden(ui.brand_lid, !branded_update);
    set_hidden(ui.brand_glint_horizontal, !branded_update);
    set_hidden(ui.brand_glint_vertical, !branded_update);
    set_hidden(ui.bear_ear_left, !bear_test);
    set_hidden(ui.bear_ear_right, !bear_test);
    set_hidden(ui.bear_head, !bear_test);
    set_hidden(ui.bear_muzzle, !bear_test);
    set_hidden(ui.bear_eye_left, !bear_test);
    set_hidden(ui.bear_eye_right, !bear_test);
    set_hidden(ui.bear_nose, !bear_test);

    if (bear_test) {
        lv_obj_set_style_bg_color(ui.screen, lv_color_hex(0x160f12), 0);
        int bear_pulse = (int)((sinf(ui.phase * 1.6f) + 1.0f) * 6.0f);
#if CONFIG_KEYPATH_FIXTURE_REDUCED_MOTION
        bear_pulse = 4;
#endif
        lv_obj_set_style_shadow_opa(ui.bear_head, (lv_opa_t)(24 + bear_pulse), 0);
        lv_obj_set_style_transform_scale(ui.bear_head, 256 + bear_pulse, 0);
        lv_obj_set_style_transform_scale(ui.bear_muzzle, 256 + bear_pulse, 0);
    }

