malpern/KeyPath/Scripts/lab/pico-hid-fixture/targets/waveshare-esp32-s3-touch-lcd-1.69/main/fixture_display.c
    if (branded_update) {
        int fill_height = 2 + (int)(visual.progress_per_mille * 34u / 1000u);
        lv_obj_set_height(ui.brand_fill, fill_height);
        lv_obj_align(ui.brand_fill, LV_ALIGN_BOTTOM_MID, 0, 0);
        lv_obj_set_style_bg_color(ui.brand_fill, accent, 0);

        int key_light = (int)((sinf(ui.phase * 1.45f) + 1.0f) * 18.0f);
        int lid_lift = 2 + (int)((sinf(ui.phase * 1.45f) + 1.0f) * 2.0f);
#if CONFIG_KEYPATH_FIXTURE_REDUCED_MOTION
        key_light = 18;
        lid_lift = 3;
#endif
        lv_obj_set_style_bg_opa(ui.brand_light, (lv_opa_t)(205 + key_light), 0);
        lv_obj_set_style_shadow_opa(ui.brand_keycap, (lv_opa_t)(18 + key_light / 2), 0);
        lv_obj_set_style_translate_y(ui.brand_lid, -lid_lift, 0);

        float glint_angle = ui.phase;
#if CONFIG_KEYPATH_FIXTURE_REDUCED_MOTION
        glint_angle = (float)visual.progress_per_mille / 1000.0f * 6.2831853f;
#endif
        int glint_x = (int)(cosf(glint_angle) * 67.0f);
        int glint_y = (int)(sinf(glint_angle) * 67.0f) - 2;
        lv_obj_align(ui.brand_glint_horizontal, LV_ALIGN_CENTER, glint_x, glint_y);
        lv_obj_align(ui.brand_glint_vertical, LV_ALIGN_CENTER, glint_x, glint_y);
        lv_obj_set_style_bg_color(ui.brand_glint_horizontal, lv_color_hex(0xfff7df), 0);
        lv_obj_set_style_bg_color(ui.brand_glint_vertical, lv_color_hex(0xfff7df), 0);
        lv_obj_set_style_bg_opa(ui.brand_glint_horizontal, LV_OPA_80, 0);
        lv_obj_set_style_bg_opa(ui.brand_glint_vertical, LV_OPA_80, 0);
    }

    if ((int)visual.icon != ui.visual_stage) {
        fixture_visual_icon_t previous = ui.visual_stage < 0
                                             ? FIXTURE_ICON_POWER
                                             : (fixture_visual_icon_t)ui.visual_stage;
        lv_label_set_text(ui.icon_back, symbol_for(previous));
        lv_label_set_text(ui.icon_front, symbol_for(visual.icon));
        ui.visual_stage = (int)visual.icon;
        ui.icon_transition_started_ms = now_ms;
    }
    uint64_t transition_elapsed = now_ms - ui.icon_transition_started_ms;
    float transition = transition_elapsed >= 240u ? 1.0f : (float)transition_elapsed / 240.0f;
    float eased = 1.0f - powf(1.0f - transition, 3.0f);
    lv_obj_set_style_text_color(ui.icon_front, accent, 0);
    lv_obj_set_style_text_color(ui.icon_back, accent, 0);
    lv_obj_set_style_text_opa(ui.icon_front, (lv_opa_t)(255.0f * eased), 0);
    lv_obj_set_style_text_opa(ui.icon_back, (lv_opa_t)(255.0f * (1.0f - transition)), 0);
    int icon_pulse = (int)(sinf(ui.phase * 1.4f) * 7.0f);
    lv_obj_set_style_transform_scale(ui.icon_front, 232 + (int)(24.0f * eased) + icon_pulse, 0);
    lv_obj_set_style_translate_x(ui.icon_front, (int)(7.0f * (1.0f - eased)), 0);
    lv_obj_set_style_translate_x(ui.icon_back, (int)(-9.0f * transition), 0);

    int orbit_start = (int)(ui.phase * 57.29578f) % 360;
    int orbit_length = output->scene == FIXTURE_UI_RUNNING ? 55 + energy / 14 : 82;
    lv_arc_set_angles(ui.orbit, orbit_start, orbit_start + orbit_length);

    int pulse = (int)((sinf(ui.phase * 1.7f) + 1.0f) * 12.0f + completion_wave * 24.0f);
#if CONFIG_KEYPATH_FIXTURE_REDUCED_MOTION
    pulse = 0;
#endif
    int halo_size = 119 + pulse / 2 + energy / 90;
    lv_obj_set_style_transform_scale(ui.halo_inner, halo_size * 256 / 124, 0);
    lv_obj_set_style_bg_color(ui.halo_inner, accent, 0);
    lv_obj_set_style_bg_opa(ui.halo_inner, (lv_opa_t)(12 + energy / 28), 0);
    lv_obj_set_style_bg_color(ui.halo_outer, accent, 0);
    lv_obj_set_style_bg_opa(ui.halo_outer, (lv_opa_t)(6 + energy / 45), 0);

    for (size_t index = 0; index < KEY_COUNT; ++index) {
        float wave = sinf(ui.phase * 2.4f - (float)index * 0.7f);
        int opacity = 35 + (int)((wave + 1.0f) * 38.0f) + energy / 8;
        if (opacity > 255) opacity = 255;
        lv_obj_set_style_bg_color(ui.keys[index], accent, 0);
        lv_obj_set_style_bg_opa(ui.keys[index], (lv_opa_t)(opacity / 3), 0);
    }

    float radius = output->scene == FIXTURE_UI_COMPLETE ? 82.0f : 72.0f + energy / 80.0f;
    radius += completion_wave * 34.0f;
    for (size_t index = 0; index < PARTICLE_COUNT; ++index) {
        if (output->quality == FIXTURE_UI_PROTECTED && index >= 4u) {
            lv_obj_add_flag(ui.particles[index], LV_OBJ_FLAG_HIDDEN);
            continue;
        }
        lv_obj_clear_flag(ui.particles[index], LV_OBJ_FLAG_HIDDEN);
        float angle = ui.phase * (1.0f + (float)(index % 3u) * 0.13f) +
                      (float)index * 0.5235988f;
        float wobble = sinf(ui.phase * 1.9f + (float)index) * (3.0f + energy / 170.0f);
        int x = 120 + (int)(cosf(angle) * (radius + wobble));
        int y = 138 + (int)(sinf(angle) * (radius + wobble));
        lv_obj_set_pos(ui.particles[index], x, y);
        lv_obj_set_style_bg_color(ui.particles[index], accent, 0);
        lv_obj_set_style_bg_opa(ui.particles[index],
                                (lv_opa_t)(40 + ((index * 31u + (unsigned int)(ui.phase * 80)) % 150u)), 0);
    }

    if (presentation->detail[0]) {
        lv_label_set_text(ui.detail, presentation->detail);
    } else if (presentation->result != FIXTURE_RESULT_NONE &&
               (presentation->dropped || presentation->duplicated || presentation->repeated)) {
        char findings[64];
        snprintf(findings, sizeof(findings), "DROP %" PRIu32 "  DUP %" PRIu32 "  REPEAT %" PRIu32,
                 presentation->dropped, presentation->duplicated, presentation->repeated);
        lv_label_set_text(ui.detail, findings);
    } else if (presentation->phase == FIXTURE_PRESENT_NEXT && presentation->next[0]) {
        lv_label_set_text(ui.detail, presentation->next);
    } else {
        lv_label_set_text(ui.detail, automatic_detail);
    }

    if (presentation->result != FIXTURE_RESULT_NONE && presentation->reports_expected > 0u) {
        char metrics[64];
        snprintf(metrics, sizeof(metrics), "%" PRIu32 "/%" PRIu32 "  P95 %" PRIu32 "us%s",
                 presentation->reports_observed, presentation->reports_expected,
                 presentation->latency_p95_us, presentation->safe_release ? "  SAFE" : "");
        lv_label_set_text(ui.quality, metrics);
        lv_obj_set_style_text_color(ui.quality, accent, 0);
    } else

