malpern/KeyPath/Scripts/lab/pico-hid-fixture/targets/waveshare-esp32-s3-touch-lcd-1.69/main/fixture_display.c
    if (branded_update) {
        lv_label_set_text_static(ui.quality, "SECURE OTA");
        lv_obj_set_style_text_color(ui.quality, accent, 0);
    } else if (output->quality == FIXTURE_UI_PROTECTED) {
        lv_label_set_text_static(ui.quality, "HID PRIORITY");
        lv_obj_set_style_text_color(ui.quality, lv_color_hex(0xffb454), 0);
    } else if (output->quality == FIXTURE_UI_ACTIVE) {
        lv_label_set_text_static(ui.quality, "LIVE 20 FPS");
        lv_obj_set_style_text_color(ui.quality, lv_color_hex(0x55c7ff), 0);
    } else {
        lv_label_set_text_static(ui.quality, "CINEMATIC");
        lv_obj_set_style_text_color(ui.quality, lv_color_hex(0x52727e), 0);
    }
    render_button_feedback(now_ms);
}

static void display_task(void *context) {
    (void)context;
    lv_display_t *display = bsp_display_start();
    configASSERT(display);
    ESP_ERROR_CHECK(bsp_display_brightness_set(CONFIG_KEYPATH_FIXTURE_BRIGHTNESS));
    configASSERT(bsp_display_lock(0u));
#if CONFIG_KEYPATH_FIXTURE_BOOT_SPLASH
    ui.screen = lv_screen_active();
    lv_obj_remove_style_all(ui.screen);
    lv_obj_set_style_bg_color(ui.screen, lv_color_hex(0x080c10), 0);
    lv_obj_set_style_bg_opa(ui.screen, LV_OPA_COVER, 0);
    build_splash();
#else
    build_ui();
#endif
    bsp_display_unlock();
#if CONFIG_KEYPATH_FIXTURE_BOOT_SPLASH
    note_display_initialized(true, false);
    play_splash();
    configASSERT(bsp_display_lock(100u));
    build_ui();
    bsp_display_unlock();
#else
    note_display_initialized(false, true);
#endif

    fixture_ui_model_t model;
    fixture_ui_model_init(&model);
    while (true) {
        fixture_runtime_snapshot_t snapshot;
        fixture_runtime_snapshot(&snapshot);
        uint64_t now_ms = (uint64_t)(esp_timer_get_time() / 1000);
        fixture_ui_output_t output = fixture_ui_model_step(&model, &snapshot.ui, now_ms);
        char automatic_detail[64];
        if (snapshot.ui.state == FIXTURE_ERROR && snapshot.error[0]) {
            snprintf(automatic_detail, sizeof(automatic_detail), "%.63s", snapshot.error);
        } else if (!snapshot.ui.wifi_connected) {
            snprintf(automatic_detail, sizeof(automatic_detail), "Trying %.32s", snapshot.network_name);
        } else {
            snprintf(automatic_detail, sizeof(automatic_detail), "%s  USB %s",
                     snapshot.network_address,
                     snapshot.ui.usb_mounted ? "READY" : "WAIT");
        }
        if (output.completion_burst) ui.completion_started_ms = now_ms;
        announce_transition(&output);
        announce_result(snapshot.presentation.result);
        fixture_board_update(snapshot.ui.state == FIXTURE_ARMED || snapshot.ui.state == FIXTURE_RUNNING);
        if (bsp_display_lock(20u)) {
            render(&output, &snapshot.presentation, automatic_detail, now_ms);
            note_display_frame(now_ms);
            bsp_display_unlock();
        }
        vTaskDelay(pdMS_TO_TICKS(output.frame_interval_ms));
    }
}

void fixture_display_start(void) {
    configASSERT(xTaskCreatePinnedToCore(display_task, "fixture_display", 8192, NULL, 6, NULL, 0) == pdPASS);
}

void fixture_display_health_snapshot(fixture_display_health_t *health) {
    if (!health) return;
    taskENTER_CRITICAL(&display_health_lock);
    *health = display_health;
    taskEXIT_CRITICAL(&display_health_lock);
}

bool fixture_display_is_healthy(void) {
    fixture_display_health_t health;
    fixture_display_health_snapshot(&health);
    uint64_t now_ms = (uint64_t)(esp_timer_get_time() / 1000);
    uint64_t age_ms = now_ms >= health.last_frame_ms ? now_ms - health.last_frame_ms : UINT64_MAX;
    return health.initialized && health.splash_complete && health.frame_sequence > 0u &&
           age_ms <= DISPLAY_HEARTBEAT_MAX_AGE_MS;
}
